УТ_для_edt/src/Catalogs/УчетныеЗаписиЭлектроннойПочты/УчетныеЗаписиЭлектроннойПочты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>УчетныеЗаписиЭлектроннойПочты</name>
  <comment>АПК:58</comment>
  <predefined>
    <items>
      <name>СистемнаяУчетнаяЗаписьЭлектроннойПочты</name>
      <description>Системная учетная запись</description>
    </items>
  </predefined>
  <attributes>
    <name>АдресЭлектроннойПочты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяОжидания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяПользователя</name>
    <comment>Имя отправителя</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьДляОтправки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьДляПолучения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьЗащищенноеСоединениеДляВходящейПочты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьЗащищенноеСоединениеДляИсходящейПочты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОставлятьКопииСообщенийНаСервере</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодХраненияСообщенийНаСервере</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПользовательSMTP</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПортСервераВходящейПочты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПортСервераИсходящейПочты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПротоколВходящейПочты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СерверВходящейПочты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СерверИсходящейПочты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетсяВходНаСерверПередОтправкой</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтправлятьСкрытыеКопииПисемНаЭтотАдрес</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВладелецУчетнойЗаписи</name>
    <comment>АПК:58</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьCRM_ДатаНачальнойЗагрузки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CRM_НастройкаСинхронизацииСВнешнимПриложением</name>
    <type>
      <types>CatalogRef.CRM_ПрограммыMSOutlook</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ПодписьВнизуПисьма</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_РазрешитьПросмотрПисемВсемПользователям</name>
    <comment>Разрешить просмотр писем всем пользователям, независимо от настройки доступа</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ИсточникЛидов</name>
    <comment>АПК:265 не проверять на орфографию имя</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_УказыватьПричинуОтклонения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_РольОтветственного</name>
    <type>
      <types>CatalogRef.РолиИсполнителей</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ВыгружатьВiCRM</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ЭтоОбщаяУчетнаяЗапись</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_СинхронизироватьПапкиСПочтовымСервером</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ОтображатьТолькоПодписанныеПапки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ОбрабатыватьОбращения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ПереноситьВОбработанные</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ЗадаватьВопросПриПереносеВОбработанные</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПриОтправкеПисемТребуетсяАвторизация</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>CRM_ПравилаОбработки</name>
    <attributes>
      <name>УсловиеОбработки</name>
      <type>
        <types>CatalogRef.CRM_УсловияОбработкиОбращений</types>
      </type>
    </attributes>
    <attributes>
      <name>ПравилоОбработки</name>
      <type>
        <types>CatalogRef.CRM_ПравилаОбработкиОбращений</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ_для_edt/src/InformationRegisters/НастройкиУчетныхЗаписейЭлектроннойПочты/НастройкиУчетныхЗаписейЭлектроннойПочты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиУчетныхЗаписейЭлектроннойПочты</name>
  <resources>
    <name>ВключатьПодписьДляНовыхСообщений</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ФорматПодписиДляНовыхСообщений</name>
    <type>
      <types>EnumRef.СпособыРедактированияЭлектронныхПисем</types>
    </type>
  </resources>
  <resources>
    <name>ПодписьДляНовыхСообщенийПростойТекст</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ПодписьДляНовыхСообщенийФорматированныйДокумент</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>ВключатьПодписьПриОтветеПересылке</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ФорматПодписиПриОтветеПересылке</name>
    <type>
      <types>EnumRef.СпособыРедактированияЭлектронныхПисем</types>
    </type>
  </resources>
  <resources>
    <name>ПодписьПриОтветеПересылкеПростойТекст</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ПодписьПриОтветеПересылкеФорматированныйДокумент</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>УдалитьПерсональнаяУчетнаяЗапись</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОтветственныйЗаОбработкуПисем</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>ОтветственныйЗаВедениеПапок</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>УдалятьПисьмаПослеОтправки</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПомещатьПисьмоВПапкуПисьмаОснования</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>НеИспользоватьВоВстроенномПочтовомКлиенте</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВПредставлениеВключатьИмяПользователя</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОбработкаПисемВыполняетсяВДругомПочтовомКлиенте</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>ДатаПоследнегоИспользования</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>УчетнаяЗаписьЭлектроннойПочты</name>
    <type>
      <types>CatalogRef.УчетныеЗаписиЭлектроннойПочты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt/src/InformationRegisters/CRM_УчетныеЗаписиЭлектроннойПочты/CRM_УчетныеЗаписиЭлектроннойПочты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>CRM_УчетныеЗаписиЭлектроннойПочты</name>
  <resources>
    <name>Администрирование</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Запись</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>Основная</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>УчетнаяЗапись</name>
    <type>
      <types>CatalogRef.УчетныеЗаписиЭлектроннойПочты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.РолиИсполнителей</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt/src/Catalogs/ГруппыПользователей/ГруппыПользователей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ГруппыПользователей</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <predefined>
    <items>
      <name>ВсеПользователи</name>
      <description>Все пользователи</description>
    </items>
  </predefined>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Состав</name>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>смартБизнесРегионы</name>
    <comment>//++ #1543 смарт: Фролов 22.11.2023 //Автоматическое распределение лидов на менеджеров</comment>
    <attributes>
      <name>БизнесРегион</name>
      <type>
        <types>CatalogRef.БизнесРегионы</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ_для_edt/src/Catalogs/УчетныеЗаписиЭлектроннойПочты/Forms/CRM_ФормаЭлемента/Module.bsl
#Область ОписаниеПеременных

&НаКлиенте
Перем РазрешенияПолучены;

&НаКлиенте
Перем ПроверкаЗаполненияПараметрыЗаписи;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	Если Параметры.БлокироватьВладельца Тогда
		РежимОткрытияОкна = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
	КонецЕсли;
	
	ДоступноПолучениеПисем = РаботаСПочтовымиСообщениямиСлужебный.НастройкиПодсистемы().ДоступноПолучениеПисем;
	// +CRM
	// Элементы.ИспользоватьУчетнуюЗапись.ОтображатьЗаголовок = ДоступноПолучениеПисем;
	Элементы.ДляПолучения.Видимость = ДоступноПолучениеПисем;
	Элементы.ОставлятьПисьмаНаСервере.Видимость = ДоступноПолучениеПисем;
	Если Не ДоступноПолучениеПисем Тогда
		Элементы.ДляОтправки.Заголовок = НСтр("ru='Использовать для отправки писем';en='Use to send emails'");
	КонецЕсли;
	Элементы.ПолучениеПисем.Доступность = ДоступноПолучениеПисем Или Объект.ТребуетсяВходНаСерверПередОтправкой;
	Элементы.ДекорацияДатаПолученияПисем.Доступность = Элементы.ПолучениеПисем.Доступность;
	Элементы.Протокол.Доступность = ДоступноПолучениеПисем;
	
	Если Объект.Ссылка.Пустая() Тогда
		Объект.ИспользоватьДляОтправки = Истина;
		Объект.ИспользоватьДляПолучения = ДоступноПолучениеПисем;
		ЗаполнитьНастройки();
	КонецЕсли;
	
	УдалятьПисьмаССервера = Объект.ПериодХраненияСообщенийНаСервере > 0;
	Если Не УдалятьПисьмаССервера Тогда
		Объект.ПериодХраненияСообщенийНаСервере = 10;
	КонецЕсли;
	
	Если НЕ Объект.Ссылка.Пустая() Тогда
		УстановитьПривилегированныйРежим(Истина);
		Пароли = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища(Объект.Ссылка, "Пароль, ПарольSMTP");
		УстановитьПривилегированныйРежим(Ложь);
		Пароль = ?(ЗначениеЗаполнено(Пароли.Пароль), ЭтотОбъект.УникальныйИдентификатор, "");
		ПарольSMTP = ?(ЗначениеЗаполнено(Пароли.ПарольSMTP), ЭтотОбъект.УникальныйИдентификатор, "");
	КонецЕсли;
	
	// +CRM
	CRM_ТекущийПользователь = Пользователи.ТекущийПользователь();
	
	ИнициализироватьДанные();
	
	ТекущийПользовательРазрешеноАдминистрирование = CRM_УправлениеЭлектроннойПочтой.ТекущийПользовательПолучитьПравоУчетнойЗаписи(Объект.Ссылка, "Администрирование");
	
	Если НЕ (ТекущийПользовательРазрешеноАдминистрирование И ПравоДоступа("Редактирование", Метаданные.Справочники.УчетныеЗаписиЭлектроннойПочты)) Тогда
		
		ТолькоПросмотр = Истина;					
		
	КонецЕсли;
	
	// Заполнить подписи для учетной записи для текущего пользователя.
	Если НЕ Объект.Ссылка.Пустая() Тогда
		МенеджерНастроек = РегистрыСведений.НастройкиУчетныхЗаписейЭлектроннойПочты.СоздатьМенеджерЗаписи();
		МенеджерНастроек.УчетнаяЗаписьЭлектроннойПочты = Объект.Ссылка;
		МенеджерНастроек.Прочитать();
		ОтветственныйЗаОбработкуПисем = МенеджерНастроек.ОтветственныйЗаОбработкуПисем;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.CRM_НастройкаСинхронизацииСВнешнимПриложением) Тогда
		Элементы.ИмяОтправителяПисем.Видимость				= Ложь;
		Элементы.АдресЭлектроннойПочты.Видимость			= Ложь;
		Объект.ИспользоватьДляОтправки 						= Ложь;
		Объект.ИспользоватьДляПолучения 					= Ложь;
		Элементы.ОтправкаПисем.Видимость 					= Ложь;
		Элементы.ПолучениеПисем.Видимость 					= Ложь;
		Элементы.ДекорацияДатаПолученияПисем.Видимость		= Ложь;
		Элементы.ПрочиеНастройки.Видимость 					= Ложь;

		Элементы.CRM_ДекорацияРазделитель3.Видимость		= Ложь;
		Элементы.CRM_ДекорацияРазделитель4.Видимость		= Ложь;

		Элементы.ДекорацияСинхронизацияOutlook.Видимость	= Истина;
	КонецЕсли;

	Элементы.ФормаЗаписатьИЗакрыть.Доступность = НЕ ТолькоПросмотр;
	Элементы.CRM_Пользователи.ТолькоПросмотр = ТолькоПросмотр;
	Элементы.ПрочиеНастройки.ТолькоПросмотр = ТолькоПросмотр;
	Элементы.СписокПользователейГруппаЗаполнить.Доступность = НЕ ТолькоПросмотр;
	Элементы.СписокПользователейПодбор.Доступность = НЕ ТолькоПросмотр;
	
	Элементы.CRM_УказыватьПричинуОтклонения.Видимость = Объект.CRM_ИсточникЛидов;
	// -CRM
	
	ЭтоПерсональнаяУчетнаяЗапись = ЗначениеЗаполнено(Объект.ВладелецУчетнойЗаписи);
	// +CRM
	//Элементы.ПользовательУчетнойЗаписи.Доступность = ЭтоПерсональнаяУчетнаяЗапись;
	//ВидУчетнойЗаписи = ?(ЭтоПерсональнаяУчетнаяЗапись, "Персональная", "Общая");
	Если Объект.CRM_ЭтоОбщаяУчетнаяЗапись Тогда
		ВидУчетнойЗаписи = "Общая";
	Иначе
		Если ЭтоПерсональнаяУчетнаяЗапись Тогда
			ВидУчетнойЗаписи = "Персональная";
		Иначе
			ВидУчетнойЗаписи = "Групповая";
		КонецЕсли;
	КонецЕсли;
	// -CRM
	Элементы.ГруппаДляКогоУчетнаяЗапись.Доступность = Пользователи.ЭтоПолноправныйПользователь();
	Элементы.ГруппаДляКогоУчетнаяЗапись.Видимость = Элементы.ГруппаДляКогоУчетнаяЗапись.Доступность;
	ВладелецУчетнойЗаписи = Объект.ВладелецУчетнойЗаписи;
	
	Если ЗначениеЗаполнено(Объект.CRM_РольОтветственного) Тогда
		РолеваяАдресация = 1;
	КонецЕсли;
	Элементы.ОтветственныйЗаОбработкуПисем.Видимость = НЕ РолеваяАдресация;
	Элементы.CRM_РольОтветственного.Видимость = РолеваяАдресация;
	
	РеквизитыТребующиеВводаПароляДляИзменения = Справочники.УчетныеЗаписиЭлектроннойПочты.РеквизитыТребующиеВводаПароляДляИзменения();
	
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.ПодключаемыеКоманды") Тогда
		МодульПодключаемыеКоманды = ОбщегоНазначения.ОбщийМодуль("ПодключаемыеКоманды");
		МодульПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	КонецЕсли;
	
	// +CRM
	CRM_СоздатьКнопкиДляКогоУчетнаяЗапись();
	CRM_ПокраситьКнопкиДляКогоУчетнаяЗаписьНаСервере();
	
	CRM_СоздатьКнопкиРолеваяАдресация();
	CRM_ПокраситьКнопкиРолеваяАдресацияНаСервере();
	
	НастроитьФормуПоВидуУчетнойЗаписи();
	
	Элементы.CRM_ВыгружатьВiCRM.Видимость = ПолучитьФункциональнуюОпцию("CRM_РаботаВЛокальномРежиме")
											И ПолучитьФункциональнуюОпцию("CRM_ИспользуетсяОбменСiCRM");
	
	Элементы.ДекорацияДатаПолученияПисем.Заголовок = "";
	УстановитьНадписьДатыЗагрузки();
	
	РегистрыСведений.CRM_НастройкиСвязиОбращенийСИнтересами.ФормаИсточникаПриСозданииНаСервере(ЭтотОбъект);
	
	// -CRM
	
КонецПроцедуры

&НаСервере
Процедура УстановитьНадписьДатыЗагрузки()
	Если НЕ Объект.Ссылка.Пустая() Тогда
		МенеджерЗаписи = РегистрыСведений.ДатыПоследнейЗагрузкиПочтовыхСообщений.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.УчетнаяЗапись = Объект.Ссылка;
		МенеджерЗаписи.Прочитать();
		Элементы.ДекорацияДатаПолученияПисем.Заголовок = "Дата последней загрузки: " + ?(ЗначениеЗаполнено(МенеджерЗаписи.ДатаЗагрузкиПисем), Формат(МенеджерЗаписи.ДатаЗагрузкиПисем, "ДФ='dd.MM.yyyy HH:mm'"), "не установлена");
	КонецЕсли;
КонецПроцедуры			

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если ПарольИзменен Тогда
		УстановитьПривилегированныйРежим(Истина);
		ОбщегоНазначения.ЗаписатьДанныеВБезопасноеХранилище(ТекущийОбъект.Ссылка, Пароль);
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
	
	Если ПарольSMTPИзменен Тогда
		УстановитьПривилегированныйРежим(Истина);
		ОбщегоНазначения.ЗаписатьДанныеВБезопасноеХранилище(ТекущийОбъект.Ссылка, ПарольSMTP, "ПарольSMTP");
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
	
	// +CRM
	РегистрыСведений.CRM_НастройкиСвязиОбращенийСИнтересами.ФормаИсточникаПриЗаписи(ЭтотОбъект);
	// -CRM
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	Если ВидУчетнойЗаписи = "Персональная" И Не ЗначениеЗаполнено(Объект.ВладелецУчетнойЗаписи) Тогда 
		Отказ = Истина;
		ТекстСообщения = НСтр("ru='Не выбран владелец учетной записи.';en='Account owner is not selected.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , "Объект.ВладелецУчетнойЗаписи");
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.ДополнительныеСвойства.Вставить("Пароль", ПроверкаПароля);
	
	// +CRM
	ТекущийОбъект.CRM_ЭтоОбщаяУчетнаяЗапись = (ВидУчетнойЗаписи = "Общая");
	// Добавляем Текущего пользователя в СписокПользователей, если это новый элемент.
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ТекПользователь = ПользователиКлиентСервер.ТекущийПользователь();
		СтрокаПользователь = CRM_СписокПользователей.Добавить();
		СтрокаПользователь.Пользователь = ТекПользователь;
	КонецЕсли;
	// -CRM
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	Если ЗавершениеРаботы Тогда Возврат; КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПередЗакрытиемПодтверждениеПолучено", ЭтотОбъект);
// +CRM
	//ОбщегоНазначенияКлиент.ПоказатьПодтверждениеЗакрытияФормы(ОписаниеОповещения, Отказ);
	CRM_ОбщегоНазначенияКлиент.CRM_ПоказатьПодтверждениеЗакрытияФормы(ОписаниеОповещения, Отказ, ЗавершениеРаботы);
// -CRM

КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	ЗаполнитьРеквизитыОбъекта();
	
	ОбработчикиПередЗаписью = Новый Массив;
	ОбработчикиПередЗаписью.Добавить(Новый ОписаниеОповещения("ПроверитьЗаполнениеПередЗаписью", ЭтотОбъект, ПараметрыЗаписи));
	ОбработчикиПередЗаписью.Добавить(Новый ОписаниеОповещения("ПроверитьРазрешенияПередЗаписью", ЭтотОбъект, ПараметрыЗаписи));
	ОбработчикиПередЗаписью.Добавить(Новый ОписаниеОповещения("ПроверитьПарольПередЗаписью", ЭтотОбъект, ПараметрыЗаписи));
	
	ПодключитьОбработчикиПередЗаписью(ОбработчикиПередЗаписью, ЭтотОбъект, Отказ, ПараметрыЗаписи);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("Запись_УчетнаяЗаписьЭлектроннойПочты",,Объект.Ссылка);
	
	Если ПараметрыЗаписи.Свойство("ЗаписатьИЗакрыть") Тогда
		Закрыть();
	КонецЕсли;
	
	ВладелецУчетнойЗаписи = Объект.ВладелецУчетнойЗаписи;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьДоступностьЭлементов();
	ВидимостьПравилОбработки();
	
	// +CRM
	CRM_ДляОтправкиПриИзменении(Элементы.ДляОтправки);
	CRM_ДляПолученияПриИзменении(Элементы.ДляПолучения);
	// -CRM
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	ЗаполнитьНастройки();

КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	НаборРегистра = РегистрыСведений.CRM_УчетныеЗаписиЭлектроннойПочты.СоздатьНаборЗаписей();
	НаборРегистра.Отбор.УчетнаяЗапись.Установить(Объект.Ссылка);
	НаборРегистра.Прочитать();
	ТаблицаНабора = НаборРегистра.Выгрузить();
	НаборРегистра.Очистить();
	// Запишем данные о пользователях учетной записи в регистр.
	Для Каждого СтрокаПользователя Из CRM_СписокПользователей Цикл
		СтрокаНабора = НаборРегистра.Добавить();
		СтрокаНабора.УчетнаяЗапись	= Объект.Ссылка;
		СтрокаНабора.Пользователь	= СтрокаПользователя.Пользователь;
		СтрокаНабора.Запись			= СтрокаПользователя.Запись;
		СтрокаНабора.Администрирование	= СтрокаПользователя.Администрирование;
		СтрокаТаблицыНабора = ТаблицаНабора.Найти(Объект.Ссылка, "УчетнаяЗапись");
		СтрокаНабора.Основная = ?(СтрокаТаблицыНабора = Неопределено, Ложь, СтрокаТаблицыНабора.Основная);
	КонецЦикла;
	НаборРегистра.Записать();
	
	МенеджерНастроек = РегистрыСведений.НастройкиУчетныхЗаписейЭлектроннойПочты.СоздатьМенеджерЗаписи();
	МенеджерНастроек.УчетнаяЗаписьЭлектроннойПочты = Объект.Ссылка;
	МенеджерНастроек.Прочитать();
	Если МенеджерНастроек.ОтветственныйЗаОбработкуПисем <> ОтветственныйЗаОбработкуПисем Тогда
		МенеджерНастроек.УчетнаяЗаписьЭлектроннойПочты = Объект.Ссылка;
		МенеджерНастроек.ОтветственныйЗаОбработкуПисем = ОтветственныйЗаОбработкуПисем;
		МенеджерНастроек.Записать(Истина);
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПротоколПриИзменении(Элемент)
	
	Если Объект.ПротоколВходящейПочты = "IMAP" Тогда
		Если СтрНачинаетсяС(Объект.СерверВходящейПочты, "pop.") Тогда
			Объект.СерверВходящейПочты = "imap." + Сред(Объект.СерверВходящейПочты, 5);
		КонецЕсли
	Иначе
		Если ПустаяСтрока(Объект.ПротоколВходящейПочты) Тогда
			Объект.ПротоколВходящейПочты = "POP";
		КонецЕсли;
		Если СтрНачинаетсяС(Объект.СерверВходящейПочты, "imap.") Тогда
			Объект.СерверВходящейПочты = "pop." + Сред(Объект.СерверВходящейПочты, 6);
		КонецЕсли;
		// +CRM
		Объект.CRM_СинхронизироватьПапкиСПочтовымСервером = Ложь;
		Объект.CRM_ОтображатьТолькоПодписанныеПапки = Ложь;
		// -CRM
	КонецЕсли;
	
	ИспользуетсяПротоколPOP = Объект.ПротоколВходящейПочты = "POP";
	УстановитьВидГруппыТребуетсяАвторизация(ЭтотОбъект, ИспользуетсяПротоколPOP);
	
	УстановитьПортВходящейПочты();
	УстановитьДоступностьЭлементов();
КонецПроцедуры

&НаКлиенте
Процедура СерверВходящейПочтыПриИзменении(Элемент)
	Объект.СерверВходящейПочты = СокрЛП(НРег(Объект.СерверВходящейПочты));
КонецПроцедуры

&НаКлиенте
Процедура СерверИсходящейПочтыПриИзменении(Элемент)
	Объект.СерверИсходящейПочты = СокрЛП(НРег(Объект.СерверИсходящейПочты));
КонецПроцедуры

&НаКлиенте
Процедура АдресЭлектроннойПочтыПриИзменении(Элемент)
	Объект.АдресЭлектроннойПочты = СокрЛП(Объект.АдресЭлектроннойПочты);
КонецПроцедуры

&НаКлиенте
Процедура ОставлятьКопииПисемНаСервереПриИзменении(Элемент)
	УстановитьДоступностьЭлементов();
КонецПроцедуры

&НаКлиенте
Процедура УдалятьПисьмаССервераПриИзменении(Элемент)
	УстановитьДоступностьЭлементов();
КонецПроцедуры

&НаКлиенте
Процедура ПарольДляПолученияПисемПриИзменении(Элемент)
	ПарольИзменен = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПарольДляОтправкиПисемПриИзменении(Элемент)
	ПарольSMTPИзменен = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПользовательУчетнойЗаписиПриИзменении(Элемент)
	// +CRM
	CRM_СписокПользователей.Очистить();
	НоваяСтрока = CRM_СписокПользователей.Добавить();
	НоваяСтрока.Пользователь = Объект.ВладелецУчетнойЗаписи;
	НоваяСтрока.Запись = Истина;
	// -CRM
	ОповеститьОбИзмененииВладельцаУчетнойЗаписи();
КонецПроцедуры

&НаКлиенте
Процедура ТребуетсяАвторизацияПриОтправкеПисемПриИзменении(Элемент)
	Элементы.АвторизацияПриОтправкеПисем1.Доступность = Объект.ПриОтправкеПисемТребуетсяАвторизация;
	Элементы.АвторизацияПриОтправкеПисем1.Видимость = Объект.ПротоколВходящейПочты = "POP";
КонецПроцедуры

&НаКлиенте
Процедура ШифрованиеПриОтправкеПочтыПриИзменении(Элемент)
	Объект.ИспользоватьЗащищенноеСоединениеДляИсходящейПочты = ШифрованиеПриОтправкеПочты = "SSL";
	УстановитьПортИсходящейПочты();
КонецПроцедуры

&НаКлиенте
Процедура ШифрованиеПриПолученииПочтыПриИзменении(Элемент)
	Объект.ИспользоватьЗащищенноеСоединениеДляВходящейПочты = ШифрованиеПриПолученииПочты = "SSL";
	УстановитьПортВходящейПочты();
КонецПроцедуры

&НаКлиенте
Процедура СпособАвторизацииПриОтправкеПочтыПриИзменении(Элемент)
	Объект.ТребуетсяВходНаСерверПередОтправкой = ?(СпособАвторизацииПриОтправкеПочты = "POP", Истина, Ложь);
	//УстановитьВидНастройкиХраненияПисемНаСервере();
	Элементы.ПолучениеПисем.Доступность = ДоступноПолучениеПисем Или Объект.ТребуетсяВходНаСерверПередОтправкой;
	Элементы.ДекорацияДатаПолученияПисем.Доступность = Элементы.ПолучениеПисем.Доступность;
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидГруппыТребуетсяАвторизация(Форма, ИспользуетсяПротоколPOP)
	
	Если ИспользуетсяПротоколPOP Тогда
		Форма.Элементы.ТребуетсяАвторизацияПриОтправкеПисем.Заголовок = НСтр("ru = 'При отправке писем требуется авторизация'");
	Иначе
		Форма.Элементы.ТребуетсяАвторизацияПриОтправкеПисем.Заголовок = НСтр("ru = 'При отправке писем требуется авторизация на сервере исходящей почты (SMTP)'");
	КонецЕсли;

	Форма.Элементы.АвторизацияПриОтправкеПисем1.Видимость = ИспользуетсяПротоколPOP;
	
КонецПроцедуры

// +CRM
&НаКлиенте
Процедура CRM_ДляОтправкиПриИзменении(Элемент)
	
	Для Каждого ЭлементГруппы Из Элементы.ОтправкаПисем.ПодчиненныеЭлементы Цикл
		Если ЭлементГруппы <> Элемент Тогда
			ЭлементГруппы.Доступность = Объект.ИспользоватьДляОтправки;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура CRM_ДляПолученияПриИзменении(Элемент)
	
	Для Каждого ЭлементГруппы Из Элементы.ПолучениеПисем.ПодчиненныеЭлементы Цикл
		Если ЭлементГруппы <> Элемент Тогда
			ЭлементГруппы.Доступность = Объект.ИспользоватьДляПолучения;
		КонецЕсли;
	КонецЦикла;
	
	Элементы.ДекорацияДатаПолученияПисем.Доступность = Объект.ИспользоватьДляПолучения;
	
КонецПроцедуры
// -CRM

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	
	Записать(Новый Структура("ЗаписатьИЗакрыть"));
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьНастройки(Команда)
	ВыполнитьПроверкуНастроек();
КонецПроцедуры

// +CRM

&НаКлиенте
Процедура CRM_ОткрытьПапкиЭлектронныхПисем(Команда)
	
	СтруктураОтбора = Новый Структура("Владелец", Объект.Ссылка);
	ПараметрыОткрытия = Новый Структура("Отбор", СтруктураОтбора);
	ОткрытьФорму("Справочник.ПапкиЭлектронныхПисем.Форма.CRM_ФормаСписка", ПараметрыОткрытия, ЭтотОбъект,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура CRM_ПравилаОбработкиЭлектроннойПочты(Команда)
	
	СтруктураОтбора = Новый Структура("Владелец", Объект.Ссылка);
	ПараметрыОткрытия = Новый Структура("Отбор", СтруктураОтбора);
	ОткрытьФорму("Справочник.ПравилаОбработкиЭлектроннойПочты.Форма.ФормаСписка", ПараметрыОткрытия, ЭтотОбъект,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура CRM_Отменить(Команда)
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура CRM_Отключить(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("CRM_ОтключитьЗавершение", ЭтотОбъект);
	ПоказатьВопрос(ОписаниеОповещения, НСтр("ru = 'Заблокировать отправку и получение писем?'"), РежимДиалогаВопрос.ДаНет, 60, КодВозвратаДиалога.Нет);
	
КонецПроцедуры

&НаКлиенте
Процедура CRM_ОтключитьЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда Возврат; КонецЕсли;
	
	Объект.ИспользоватьДляОтправки = Ложь;
	Объект.ИспользоватьДляПолучения = Ложь;
	
	Модифицированность = Истина;
	
	CRM_ДляОтправкиПриИзменении(Элементы.ДляОтправки);
	CRM_ДляПолученияПриИзменении(Элементы.ДляПолучения);
	
КонецПроцедуры

&НаКлиенте
Процедура CRM_ДоступноВсем(Команда)
	
	ВидУчетнойЗаписи = "Общая";
	CRM_ПокраситьКнопкиДляКогоУчетнаяЗаписьНаСервере();
	
	Объект.CRM_РазрешитьПросмотрПисемВсемПользователям = Истина;
	
	НастроитьФормуПоВидуУчетнойЗаписи();
	
	ОповеститьОбИзмененииВладельцаУчетнойЗаписи();
	
КонецПроцедуры

&НаКлиенте
Процедура CRM_ДоступноПользователю(Команда)
	
	ВидУчетнойЗаписи = "Персональная";
	CRM_ПокраситьКнопкиДляКогоУчетнаяЗаписьНаСервере();
	
	НастроитьФормуПоВидуУчетнойЗаписи();
	
	ОповеститьОбИзмененииВладельцаУчетнойЗаписи();
	
КонецПроцедуры

&НаКлиенте
Процедура CRM_ДоступноСпискуПользователей(Команда)
	
	ВидУчетнойЗаписи = "Групповая";
	CRM_ПокраситьКнопкиДляКогоУчетнаяЗаписьНаСервере();
	
	НастроитьФормуПоВидуУчетнойЗаписи();
	
	ОповеститьОбИзмененииВладельцаУчетнойЗаписи();
	
КонецПроцедуры

&НаКлиенте
Процедура CRM_Ответственный(Команда)
	
	РолеваяАдресация = 0;
	CRM_ПокраситьКнопкиРолеваяАдресацияНаСервере();
	
	РолеваяАдресацияПриИзмененииСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура CRM_Роль(Команда)
	
	РолеваяАдресация = 1;
	CRM_ПокраситьКнопкиРолеваяАдресацияНаСервере();
	
	РолеваяАдресацияПриИзмененииСервер();
	
КонецПроцедуры

// -CRM

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьНастройки()
	
	ИспользуетсяПротоколPOP = Объект.ПротоколВходящейПочты = "POP";
	Элементы.АвторизацияПриОтправкеПисем1.Доступность = Объект.ПриОтправкеПисемТребуетсяАвторизация;
	УстановитьВидГруппыТребуетсяАвторизация(ЭтотОбъект, ИспользуетсяПротоколPOP);
	
	ШифрованиеПриОтправкеПочты = ?(Объект.ИспользоватьЗащищенноеСоединениеДляИсходящейПочты, "SSL", "Авто");
	ШифрованиеПриПолученииПочты = ?(Объект.ИспользоватьЗащищенноеСоединениеДляВходящейПочты, "SSL", "Авто");
	
	СпособАвторизацииПриОтправкеПочты = ?(Объект.ТребуетсяВходНаСерверПередОтправкой, "POP", "SMTP");
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПортВходящейПочты()
	Если Объект.ПротоколВходящейПочты = "IMAP" Тогда
		Если Объект.ПортСервераВходящейПочты = 995 Тогда
			Объект.ПортСервераВходящейПочты = 993;
		КонецЕсли;
	Иначе
		Если Объект.ПортСервераВходящейПочты = 993 Тогда
			Объект.ПортСервераВходящейПочты = 995;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПортИсходящейПочты()
	Если Объект.ИспользоватьЗащищенноеСоединениеДляИсходящейПочты Тогда
		Если Объект.ПортСервераИсходящейПочты = 587 Тогда
			Объект.ПортСервераИсходящейПочты = 465;
		КонецЕсли;
	Иначе
		Если Объект.ПортСервераИсходящейПочты = 465 Тогда
			Объект.ПортСервераИсходящейПочты = 587;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытиемПодтверждениеПолучено(РезультатВопроса, ДополнительныеПараметры) Экспорт
	Записать(Новый Структура("ЗаписатьИЗакрыть"));
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступностьЭлементов()
	ИспользуетсяПротоколPOP = Объект.ПротоколВходящейПочты = "POP";
	Элементы.ОставлятьПисьмаНаСервере.Видимость = ИспользуетсяПротоколPOP И ДоступноПолучениеПисем;
	
	Элементы.НастройкаПериодаХраненияПисем.Доступность = Объект.ОставлятьКопииСообщенийНаСервере;
	Элементы.ПериодХраненияСообщенийНаСервере.Доступность = УдалятьПисьмаССервера;
	Элементы.ДекорацияДатаПолученияПисем.Видимость = Объект.ПротоколВходящейПочты = "IMAP";
	// +CRM
	Элементы.ГруппаСинхронизацияIMAP.Видимость = (Объект.ПротоколВходящейПочты = "IMAP");
	Элементы.CRM_НастройкаСинхронизацииПапок.Видимость = Объект.CRM_СинхронизироватьПапкиСПочтовымСервером;
	Элементы.CRM_ОтображатьТолькоПодписанныеПапки.Видимость = Объект.CRM_СинхронизироватьПапкиСПочтовымСервером;
	Элементы.CRM_ЗадаватьВопросПриПереносеВОбработанные.Доступность = Объект.CRM_ПереноситьВОбработанные;
	// -CRM
КонецПроцедуры

&НаСервере
Функция ЗапросыНаИспользованиеВнешнихРесурсов()
	
	Запрос = Неопределено;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.ПрофилиБезопасности") Тогда
		МодульРаботаВБезопасномРежиме = ОбщегоНазначения.ОбщийМодуль("РаботаВБезопасномРежиме");
		Запрос = МодульРаботаВБезопасномРежиме.ЗапросНаИспользованиеВнешнихРесурсов(Разрешения(), Объект.Ссылка);
	КонецЕсли;
	
	Возврат ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Запрос);
	
КонецФункции

&НаСервере
Функция Разрешения()
	
	Результат = Новый Массив;
	
	МодульРаботаВБезопасномРежиме = ОбщегоНазначения.ОбщийМодуль("РаботаВБезопасномРежиме");
	
	Если Объект.ИспользоватьДляОтправки Тогда
		Результат.Добавить(
			МодульРаботаВБезопасномРежиме.РазрешениеНаИспользованиеИнтернетРесурса(
				"SMTP",
				Объект.СерверИсходящейПочты,
				Объект.ПортСервераИсходящейПочты,
				НСтр("ru = 'Электронная почта.'")));
	КонецЕсли;
	
	Если Объект.ИспользоватьДляПолучения Тогда
		Результат.Добавить(
			МодульРаботаВБезопасномРежиме.РазрешениеНаИспользованиеИнтернетРесурса(
				Объект.ПротоколВходящейПочты,
				Объект.СерверВходящейПочты,
				Объект.ПортСервераВходящейПочты,
				НСтр("ru = 'Электронная почта.'")));
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ОповеститьОбИзмененииВладельцаУчетнойЗаписи()
	Оповестить("ПриИзмененииВидаУчетнойЗаписиЭлектроннойПочты", ВидУчетнойЗаписи = "Персональная", ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Функция ПроверкаЗаполненияВыполнена(ПараметрыЗаписи)
	Если ПараметрыЗаписи.Свойство("ПроверкаЗаполненияВыполнена") Тогда
		Возврат Истина;
	КонецЕсли;
	
	ПроверкаЗаполненияПараметрыЗаписи = ПараметрыЗаписи;
	ПодключитьОбработчикОжидания("ПроверитьЗаполнениеИЗаписать", 0.1, Истина);
	
	Возврат Ложь;
КонецФункции

&НаКлиенте
Процедура ПроверитьЗаполнениеИЗаписать()
	Если ПроверитьЗаполнение() Тогда
		ПроверкаЗаполненияПараметрыЗаписи.Вставить("ПроверкаЗаполненияВыполнена");
		Записать(ПроверкаЗаполненияПараметрыЗаписи);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПроверкуНастроек()
	Если Модифицированность Тогда
		Записать(Новый Структура("ПроверитьНастройки"));
	Иначе
		РаботаСПочтовымиСообщениямиКлиент.ПроверитьНастройкиУчетнойЗаписи(Объект.Ссылка);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьРеквизитыОбъекта()
	
	Если Не УдалятьПисьмаССервера Тогда
		Объект.ПериодХраненияСообщенийНаСервере = 0;
	КонецЕсли;
	
	Если Объект.ПротоколВходящейПочты = "IMAP" Тогда
		Объект.ОставлятьКопииСообщенийНаСервере = Истина;
		Объект.ПериодХраненияСообщенийНаСервере = 0;
	КонецЕсли;
	
	// +CRM
	//Если ВидУчетнойЗаписи = "Общая" И ЗначениеЗаполнено(Объект.ВладелецУчетнойЗаписи) Тогда
	Если (ВидУчетнойЗаписи = "Общая" Или ВидУчетнойЗаписи = "Групповая") И ЗначениеЗаполнено(Объект.ВладелецУчетнойЗаписи) Тогда
	// -CRM
		Объект.ВладелецУчетнойЗаписи = Неопределено;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПроверитьЗаполнениеПередЗаписью(Отказ, ПараметрыЗаписи) Экспорт
	
	Если Не ПроверитьЗаполнение() Тогда
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьРазрешенияПередЗаписью(Отказ, ПараметрыЗаписи) Экспорт
	
	Отказ = Истина;
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеПроверкиРазрешений", ЭтотОбъект, ПараметрыЗаписи);
	
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.ПрофилиБезопасности") Тогда
		МодульРаботаВБезопасномРежимеКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("РаботаВБезопасномРежимеКлиент");
		МодульРаботаВБезопасномРежимеКлиент.ПрименитьЗапросыНаИспользованиеВнешнихРесурсов(
			ЗапросыНаИспользованиеВнешнихРесурсов(), ЭтотОбъект, ОписаниеОповещения);
	Иначе
		ВыполнитьОбработкуОповещения(ОписаниеОповещения, КодВозвратаДиалога.ОК);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьПарольПередЗаписью(Отказ, ПараметрыЗаписи) Экспорт
	
	Если Не ПроверкаПароляВыполнена(ПараметрыЗаписи) Тогда
		Отказ = Истина;
		ПроверкаПароля = "";
		ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВводаПароля", ЭтотОбъект, ПараметрыЗаписи);
		ОткрытьФорму("Справочник.УчетныеЗаписиЭлектроннойПочты.Форма.ПроверкаДоступаКУчетнойЗаписи", , ЭтотОбъект, , , , ОписаниеОповещения);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеПроверкиРазрешений(Результат, ПараметрыЗаписи) Экспорт
	
	Если Результат = КодВозвратаДиалога.ОК Тогда
		ПараметрыЗаписи.Вставить("РазрешенияПолучены");
		Записать(ПараметрыЗаписи);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ПроверкаПароляВыполнена(ПараметрыЗаписи)
	
	Если Не ПараметрыЗаписи.Свойство("ПарольВведен") Тогда
		ЗначенияРеквизитовПередЗаписью = Новый Структура(РеквизитыТребующиеВводаПароляДляИзменения);
		ЗаполнитьЗначенияСвойств(ЗначенияРеквизитовПередЗаписью, Объект);
		Возврат Не ТребуетсяПроверкаПароля(Объект.Ссылка, ЗначенияРеквизитовПередЗаписью);
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

&НаСервереБезКонтекста
Функция ТребуетсяПроверкаПароля(Ссылка, ЗначенияРеквизитов)
	Возврат Справочники.УчетныеЗаписиЭлектроннойПочты.ТребуетсяПроверкаПароля(Ссылка, ЗначенияРеквизитов);
КонецФункции

&НаКлиенте
Процедура ПослеВводаПароля(Пароль, ПараметрыЗаписи) Экспорт
	
	Если ТипЗнч(Пароль) = Тип("Строка") Тогда
		ПроверкаПароля = Пароль;
		ПараметрыЗаписи.Вставить("ПарольВведен");
		Записать(ПараметрыЗаписи);
	КонецЕсли;
	
КонецПроцедуры

// Последовательно вызывает указанные обработчики в событии ПередЗаписью через обработчик ожидания.
&НаКлиенте
Процедура ПодключитьОбработчикиПередЗаписью(Обработчики, Форма, Отказ, ПараметрыЗаписи)
	
	Если Не ПараметрыЗаписи.Свойство("ОбработчикиПередЗаписью") Тогда
		ПараметрыЗаписи.Вставить("ОбработчикиПередЗаписью", Новый Структура)
	КонецЕсли;
	
	Для Каждого Обработчик Из Обработчики Цикл
		Если Не ПараметрыЗаписи.ОбработчикиПередЗаписью.Свойство(Обработчик.ИмяПроцедуры) Тогда
			ПараметрыЗаписи.ОбработчикиПередЗаписью.Вставить(Обработчик.ИмяПроцедуры, Ложь);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого Проверка Из ПараметрыЗаписи.ОбработчикиПередЗаписью Цикл
		Если Проверка.Значение = Ложь Тогда
			Отказ = Истина;
			ОписаниеОповещения = Новый ОписаниеОповещения(Проверка.Ключ, Форма, ПараметрыЗаписи);
			
			ИмяПараметра = "СтандартныеПодсистемы.ОбработчикОжиданияПередЗаписьюВФорме";
			Если ПараметрыПриложения[ИмяПараметра] = Неопределено Тогда
				ПараметрыПриложения.Вставить(ИмяПараметра, Новый Массив);
			КонецЕсли;
			ПараметрыПриложения[ИмяПараметра].Добавить(ОписаниеОповещения);
			
			ПодключитьОбработчикОжидания("ВыполнитьПроверкуПередЗаписьюВФорме", 0.1, Истина);
			Возврат;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПроверкуПередЗаписьюВФорме()
	
	ИмяПараметра = "СтандартныеПодсистемы.ОбработчикОжиданияПередЗаписьюВФорме";
	Если ПараметрыПриложения[ИмяПараметра] = Неопределено Тогда
		ПараметрыПриложения.Вставить(ИмяПараметра, Новый Массив);
	КонецЕсли;
	ОбработчикиОжидания = ПараметрыПриложения[ИмяПараметра];
	
	Если ОбработчикиОжидания.Количество() > 0 Тогда
		ОписаниеОповещения = ОбработчикиОжидания[0];
		ИмяПроцедуры = ОбработчикиОжидания[0].ИмяПроцедуры;
		Форма = ОбработчикиОжидания[0].Модуль;
		ПараметрыЗаписи = ОбработчикиОжидания[0].ДополнительныеПараметры;
		ОбработчикиОжидания.Удалить(0);
		ПараметрыЗаписи.ОбработчикиПередЗаписью[ИмяПроцедуры] = Истина;
		Отказ = Ложь;
		ВыполнитьОбработкуОповещения(ОписаниеОповещения, Отказ);
		Если Не Отказ Тогда
			Форма.Записать(ПараметрыЗаписи);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// +CRM
#Область CRM

&НаКлиенте
Процедура CRM_ПереноситьВОбработанныеПриИзменении(Элемент)	
	
	Элементы.CRM_ЗадаватьВопросПриПереносеВОбработанные.Доступность = Объект.CRM_ПереноситьВОбработанные;
	
	Если НЕ Объект.CRM_ПереноситьВОбработанные Тогда
		Объект.CRM_ЗадаватьВопросПриПереносеВОбработанные = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Функция получает список пользователей.
//
// Параметры:
//	ГруппаПользователей	- СправочникСсылка	- Группа, пользователей которой нужно получить.
//
// Возвращаемое значение:
//	СписокЗначений	- Список пользователей.
//
Функция ПолучитьСписокПользователей(ГруппаПользователей = Неопределено, ВключаяВложенные = Ложь)
	мСписокПользователей = Новый СписокЗначений;
	Запрос = Новый Запрос;
	Если ЗначениеЗаполнено(ГруппаПользователей) И ГруппаПользователей <> Справочники.ГруппыПользователей.ВсеПользователи Тогда
		Запрос.УстановитьПараметр("Ссылка", ГруппаПользователей);
		Запрос.Текст = "ВЫБРАТЬ
           |	ГруппыПользователейСостав.Пользователь
           |ИЗ
           |	Справочник.ГруппыПользователей.Состав КАК ГруппыПользователейСостав
           |ГДЕ";
		Если ВключаяВложенные Тогда
			Запрос.Текст = Запрос.Текст + "
           |	ГруппыПользователейСостав.Ссылка В ИЕРАРХИИ(&Ссылка)";
		Иначе	   
			Запрос.Текст = Запрос.Текст + "
           |	ГруппыПользователейСостав.Ссылка = &Ссылка";
		КонецЕсли;   
	Иначе
		Запрос.Текст = "ВЫБРАТЬ
           |	Пользователи.Ссылка КАК Пользователь
           |ИЗ
           |	Справочник.Пользователи КАК Пользователи";
	КонецЕсли;				   
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СтрокаПользователя = мСписокПользователей.Добавить();
		СтрокаПользователя.Значение	= Выборка.Пользователь;
	КонецЦикла;
	Возврат мСписокПользователей;
КонецФункции // ПолучитьСписокПользователей() 	

&НаКлиенте
// Процедура выполняет заполнение списка пользователей на форме.
//
// Параметры:
//	мСписокПользователей	- СписокЗначений	- Список пользователей для заполнения на форме
//
Процедура ЗаполнитьСписокПользователей(мСписокПользователей)
	// Удаляем дубли из списка
	Для Каждого СтрокаСписка Из CRM_СписокПользователей Цикл
		ТекПользователь = мСписокПользователей.НайтиПоЗначению(СтрокаСписка.Пользователь);
		Если НЕ (ТекПользователь = Неопределено) Тогда 
			мСписокПользователей.Удалить(ТекПользователь);
		КонецЕсли;
	КонецЦикла;	
	// Добавляем новых пользователей в список.
	Для Каждого СтрокаСписка Из мСписокПользователей Цикл
		СтрокаПользователя = CRM_СписокПользователей.Добавить();
		СтрокаПользователя.Пользователь	= СтрокаСписка.Значение;
		СтрокаПользователя.Запись = Истина;
	КонецЦикла;	
	CRM_СписокПользователей.Сортировать("Пользователь Возр");
КонецПроцедуры // ЗаполнитьСписокПользователей()	

&НаСервере
// Функция проверяет наличие вложенных групп у группы.
//
// Параметры:
//	ГруппаПользователей	- СпрвочникСсылка	- Группа для проверки.
//
// Возвращаемое значение:
//	Булево	- Наличие вложенных групп.
//
Функция ЕстьВложенныеГруппы(ГруппаПользователей)
	Если НЕ ЗначениеЗаполнено(ГруппаПользователей) Тогда
		Возврат Ложь;
	КонецЕсли;
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Родитель", ГруппаПользователей);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ГруппыПользователей.Ссылка
	               |ИЗ
	               |	Справочник.ГруппыПользователей КАК ГруппыПользователей
	               |ГДЕ
	               |	ГруппыПользователей.Родитель = &Родитель";
	Выборка = Запрос.Выполнить();
	Возврат НЕ Выборка.Пустой(); 
КонецФункции // ЕстьВложенныеГруппы()

&НаСервереБезКонтекста
// Функция проверяет использование функциональной опции "ИспользоватьГруппыПользователей".
//
// Параметры:
//	Нет.
//
// Возвращаемое значение:
//	Булево	- Использование опции.
//
Функция ПолучитьИспользованиеГрупп()
	Возврат ПолучитьФункциональнуюОпцию("ИспользоватьГруппыПользователей");
КонецФункции // ПолучитьИспользованиеГрупп()
	
&НаКлиенте
// Процедура заполнения по группе пользователей.
//
Процедура ЗаполнитьПоГруппеПользователей(Команда)
	ИспользоватьГруппы = ПолучитьИспользованиеГрупп();
	Если НЕ ИспользоватьГруппы Тогда
		ПоказатьПредупреждение(, "Отключена настройка ""Использовать группы пользователей""");
		Возврат;
	КонецЕсли;
	ПараметрыФормы = Новый Структура;
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗаполнитьПоГруппеПользователейПродолжение", ЭтотОбъект);
	ОткрытьФорму("Справочник.ГруппыПользователей.ФормаВыбораГруппы", ПараметрыФормы, ЭтотОбъект,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоГруппеПользователейПродолжение(ГруппаПользователей, ДополнительныеПараметры) Экспорт
	Если ГруппаПользователей <> Неопределено Тогда
		ВключаяВложенные = ЕстьВложенныеГруппы(ГруппаПользователей);
		Если ВключаяВложенные Тогда
			ОписаниеОповещения = Новый ОписаниеОповещения("ЗаполнитьПоГруппеПользователейЗавершение", ЭтотОбъект, ГруппаПользователей);
			ПоказатьВопрос(ОписаниеОповещения, "Загрузить также пользователей вложенных групп?", РежимДиалогаВопрос.ДаНет, 0);
		Иначе
			ЗаполнитьПоГруппеПользователейЗавершение(Неопределено, ГруппаПользователей)
		КонецЕсли;		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоГруппеПользователейЗавершение(Ответ, ГруппаПользователей) Экспорт
	Если Ответ  = КодВозвратаДиалога.Да Тогда
		ВключаяВложенные = Истина;
	Иначе	
		ВключаяВложенные = Ложь;
	КонецЕсли;			
	мСписокПользователей = ПолучитьСписокПользователей(ГруппаПользователей, ВключаяВложенные);
	ЗаполнитьСписокПользователей(мСписокПользователей);
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
// Процедура очистки списка пользователей.
//
Процедура ОчиститьСписок(Команда)
	ТД = Элементы.CRM_СписокПользователей.ТекущиеДанные;
	Если ТД = Неопределено Тогда Возврат; КонецЕсли;
	ОписаниеОповещения = Новый ОписаниеОповещения("ОчиститьСписокЗавершение", ЭтотОбъект);
	ПоказатьВопрос(ОписаниеОповещения, "Все пользователи из списка будут удалены. Продолжить?", РежимДиалогаВопрос.ДаНет, 0);
КонецПроцедуры // ОчиститьСписок()

&НаКлиенте
Процедура ОчиститьСписокЗавершение(Ответ, ДополнительныеПараметры) Экспорт
	Если Ответ = КодВозвратаДиалога.Да Тогда
		CRM_СписокПользователей.Очистить();
		Модифицированность = Истина;
	КонецЕсли;	
КонецПроцедуры // ОчиститьСписок()

&НаКлиенте
// Процедура заполнения подбором.
//
Процедура Подбор(Команда)
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("РежимВыбора",				Истина);
	ПараметрыФормы.Вставить("МножественныйВыбор",		Истина);
	ПараметрыФормы.Вставить("ВыборГруппПользователей",	Ложь);
	ПараметрыФормы.Вставить("ЗакрыватьПриВыборе",		Ложь);
	ФормаПодбора = ОткрытьФорму("Справочник.Пользователи.ФормаВыбора", ПараметрыФормы, ЭтотОбъект);
КонецПроцедуры

&НаСервере
// Процедура заполняет таблицу пользователей учетной записи.
//
Процедура ИнициализироватьДанные()
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("УчетнаяЗапись", Объект.Ссылка);
	Запрос.Текст = "ВЫБРАТЬ
	               |	CRM_УчетныеЗаписиЭлектроннойПочты.Пользователь КАК Пользователь,
	               |	CRM_УчетныеЗаписиЭлектроннойПочты.Администрирование,
	               |	CRM_УчетныеЗаписиЭлектроннойПочты.Запись
	               |ИЗ
	               |	РегистрСведений.CRM_УчетныеЗаписиЭлектроннойПочты КАК CRM_УчетныеЗаписиЭлектроннойПочты
	               |ГДЕ
	               |	CRM_УчетныеЗаписиЭлектроннойПочты.УчетнаяЗапись = &УчетнаяЗапись";
	ВыборкаРезультатовЗапроса = Запрос.Выполнить().Выбрать();
	Пока ВыборкаРезультатовЗапроса.Следующий() Цикл
		СтрокаПользователя = CRM_СписокПользователей.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаПользователя, ВыборкаРезультатовЗапроса);
	КонецЦикла;
	CRM_СписокПользователей.Сортировать("Пользователь Возр");
КонецПроцедуры//

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Массив") Тогда
		мСписокПользователей = Новый СписокЗначений;
		мСписокПользователей.ЗагрузитьЗначения(ВыбранноеЗначение);
		ЗаполнитьСписокПользователей(мСписокПользователей);
		Модифицированность = Истина;
	ИначеЕсли ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.Пользователи") Тогда
		мСписокПользователей = Новый СписокЗначений;
		мСписокПользователей.Добавить(ВыбранноеЗначение);
		ЗаполнитьСписокПользователей(мСписокПользователей);
		Модифицированность = Истина;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура CRM_ИсточникЛидовПриИзменении(Элемент)
	Элементы.CRM_УказыватьПричинуОтклонения.Видимость = Объект.CRM_ИсточникЛидов;
	Если НЕ Объект.CRM_ИсточникЛидов Тогда
		Объект.CRM_УказыватьПричинуОтклонения = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура РолеваяАдресацияПриИзмененииСервер()
	Элементы.ОтветственныйЗаОбработкуПисем.Видимость = НЕ РолеваяАдресация;
	Элементы.CRM_РольОтветственного.Видимость = РолеваяАдресация;
	Если РолеваяАдресация = 0 Тогда
		Объект.CRM_РольОтветственного = Справочники.РолиИсполнителей.ПустаяСсылка();
	Иначе
		ОтветственныйЗаОбработкуПисем = Справочники.Пользователи.ПустаяСсылка();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура CRM_СписокПользователейПользовательПриИзменении(Элемент)
	Если CRM_СписокПользователей.Количество() = 1 Тогда
		CRM_СписокПользователей[0].Запись = Истина;
		CRM_СписокПользователей[0].Администрирование = Истина;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура НастроитьФормуПоВидуУчетнойЗаписи()
	
	Если ВидУчетнойЗаписи = "Общая" Тогда
		Элементы.CRM_Пользователи.Видимость = Ложь;
		Элементы.ПользовательУчетнойЗаписи.Видимость = Ложь;
	ИначеЕсли ВидУчетнойЗаписи = "Персональная" Тогда
		Элементы.CRM_Пользователи.Видимость = Ложь;
		Элементы.ПользовательУчетнойЗаписи.Видимость = Истина;
	ИначеЕсли ВидУчетнойЗаписи = "Групповая" Тогда
		Элементы.CRM_Пользователи.Видимость = Истина;
		Элементы.ПользовательУчетнойЗаписи.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура CRM_СоздатьКнопкиДляКогоУчетнаяЗапись()
	
	СтруктураСоздания = Новый Структура;
	
	СтруктураКоманднаяПанель = Новый Структура;
	СтруктураКоманднаяПанель.Вставить("Имя", "CRM_ТумблерВидУчетнойЗаписи_Группа");
	СтруктураКоманднаяПанель.Вставить("Родитель", "CRM_ТумблерВидУчетнойЗаписи");
	
	СтруктураГруппаКнопок = Новый Структура;
	СтруктураГруппаКнопок.Вставить("Имя", "CRM_ТумблерВидУчетнойЗаписи_Элемент");
	
	СтруктураСоздания.Вставить("СтруктураКоманднаяПанель", СтруктураКоманднаяПанель);
	СтруктураСоздания.Вставить("СтруктураГруппаКнопок", СтруктураГруппаКнопок);
	
	СтруктураВидимыеКнопки = Новый Структура;
	
	СтруктураКнопка = Новый Структура;
	ИмяОписания = "CRM_ДоступноВсем";
	СтруктураКнопка.Вставить("ИмяКнопки", ИмяОписания);
	СтруктураКнопка.Вставить("Заголовок", НСтр("ru='Всем';en='To all'"));
	СтруктураКнопка.Вставить("ИмяКоманды", ИмяОписания);
	СтруктураКнопка.Вставить("Действие", ИмяОписания);
	СтруктураКнопка.Вставить("Отображение", ОтображениеКнопки.Текст);
	СтруктураКнопка.Вставить("ОтображениеФигуры", ОтображениеФигурыКнопки.Всегда);
	СтруктураКнопка.Вставить("Пометка", Истина);
	
	СтруктураВидимыеКнопки.Вставить(ИмяОписания, СтруктураКнопка);
	
	СтруктураКнопка = Новый Структура;
	ИмяОписания = "CRM_ДоступноПользователю";
	СтруктураКнопка.Вставить("ИмяКнопки", ИмяОписания);
	СтруктураКнопка.Вставить("Заголовок", НСтр("ru='Пользователю';en='User'"));
	СтруктураКнопка.Вставить("ИмяКоманды", ИмяОписания);
	СтруктураКнопка.Вставить("Действие", ИмяОписания);
	СтруктураКнопка.Вставить("Отображение", ОтображениеКнопки.Текст);
	СтруктураКнопка.Вставить("ОтображениеФигуры", ОтображениеФигурыКнопки.Всегда);
	
	СтруктураВидимыеКнопки.Вставить(ИмяОписания, СтруктураКнопка);
	
	СтруктураКнопка = Новый Структура;
	ИмяОписания = "CRM_ДоступноСпискуПользователей";
	СтруктураКнопка.Вставить("ИмяКнопки", ИмяОписания);
	СтруктураКнопка.Вставить("Заголовок", НСтр("ru='Списку пользователей';en='User list'"));
	СтруктураКнопка.Вставить("ИмяКоманды", ИмяОписания);
	СтруктураКнопка.Вставить("Действие", ИмяОписания);
	СтруктураКнопка.Вставить("Отображение", ОтображениеКнопки.Текст);
	СтруктураКнопка.Вставить("ОтображениеФигуры", ОтображениеФигурыКнопки.Всегда);
	
	СтруктураВидимыеКнопки.Вставить(ИмяОписания, СтруктураКнопка);
	
	СтруктураСоздания.Вставить("СтруктураВидимыеКнопки", СтруктураВидимыеКнопки);

	Если CRM_ЛицензированиеЭкспортныеМетоды.ПодсистемаCRMИспользуется() Тогда
		CRM_ЛицензированиеЭкспортныеМетоды.ПолучитьЗащищеннуюОбработку().СформироватьКоманднуюПанельПоСтуктуре(ЭтотОбъект, СтруктураСоздания);
	КонецЕсли;
	
	ГруппаКнопокТумблера = Элементы.Найти("CRM_ТумблерВидУчетнойЗаписи_Группа");
	Если ГруппаКнопокТумблера <> Неопределено Тогда
		ГруппаКнопокТумблера.ГоризонтальноеПоложение = ГоризонтальноеПоложениеЭлемента.Центр;
		ГруппаКнопокТумблера.ГоризонтальноеПоложениеВГруппе = ГоризонтальноеПоложениеЭлемента.Центр;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура CRM_ПокраситьКнопкиДляКогоУчетнаяЗаписьНаСервере()
	
	НомерКнопки = 1;
	
	Если ВидУчетнойЗаписи = "Общая" Тогда
		НомерКнопки = 1;
	ИначеЕсли ВидУчетнойЗаписи = "Персональная" Тогда
		НомерКнопки = 2;
	ИначеЕсли ВидУчетнойЗаписи = "Групповая" Тогда
		НомерКнопки = 3;
	КонецЕсли;
	
	СтруктураВидимыеКнопки = Новый Структура;
	
	СтруктураКнопка = Новый Структура;
	ИмяОписания = "CRM_ДоступноВсем";
	СтруктураКнопка.Вставить("ИмяКнопки", ИмяОписания);
	СтруктураКнопка.Вставить("Пометка", ?(НомерКнопки = 1, Истина, Ложь));
	
	СтруктураВидимыеКнопки.Вставить(ИмяОписания, СтруктураКнопка);
	
	СтруктураКнопка = Новый Структура;
	ИмяОписания = "CRM_ДоступноПользователю";
	СтруктураКнопка.Вставить("ИмяКнопки", ИмяОписания);
	СтруктураКнопка.Вставить("Пометка", ?(НомерКнопки = 2, Истина, Ложь));
	
	СтруктураВидимыеКнопки.Вставить(ИмяОписания, СтруктураКнопка);
	
	СтруктураКнопка = Новый Структура;
	ИмяОписания = "CRM_ДоступноСпискуПользователей";
	СтруктураКнопка.Вставить("ИмяКнопки", ИмяОписания);
	СтруктураКнопка.Вставить("Пометка", ?(НомерКнопки = 3, Истина, Ложь));
	
	СтруктураВидимыеКнопки.Вставить(ИмяОписания, СтруктураКнопка);
	
	Если CRM_ЛицензированиеЭкспортныеМетоды.ПодсистемаCRMИспользуется() Тогда
		CRM_ЛицензированиеЭкспортныеМетоды.ПолучитьЗащищеннуюОбработку().ПокраситьКнопки(ЭтотОбъект, СтруктураВидимыеКнопки);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура CRM_СоздатьКнопкиРолеваяАдресация()
	
	СтруктураСоздания = Новый Структура;
	
	СтруктураКоманднаяПанель = Новый Структура;
	СтруктураКоманднаяПанель.Вставить("Имя", "CRM_ТумблерРолеваяАдресация_Группа");
	СтруктураКоманднаяПанель.Вставить("Родитель", "CRM_ТумблерРолеваяАдресация");
	
	СтруктураГруппаКнопок = Новый Структура;
	СтруктураГруппаКнопок.Вставить("Имя", "CRM_ТумблерРолеваяАдресация_Элемент");
	
	СтруктураСоздания.Вставить("СтруктураКоманднаяПанель", СтруктураКоманднаяПанель);
	СтруктураСоздания.Вставить("СтруктураГруппаКнопок", СтруктураГруппаКнопок);
	
	СтруктураВидимыеКнопки = Новый Структура;
	
	СтруктураКнопка = Новый Структура;
	ИмяОписания = "CRM_Ответственный";
	СтруктураКнопка.Вставить("ИмяКнопки", ИмяОписания);
	СтруктураКнопка.Вставить("Заголовок", НСтр("ru='Ответственный';en='Responsible'"));
	СтруктураКнопка.Вставить("ИмяКоманды", ИмяОписания);
	СтруктураКнопка.Вставить("Действие", ИмяОписания);
	СтруктураКнопка.Вставить("Отображение", ОтображениеКнопки.Текст);
	СтруктураКнопка.Вставить("ОтображениеФигуры", ОтображениеФигурыКнопки.Всегда);
	СтруктураКнопка.Вставить("Пометка", Истина);
	
	СтруктураВидимыеКнопки.Вставить(ИмяОписания, СтруктураКнопка);
	
	СтруктураКнопка = Новый Структура;
	ИмяОписания = "CRM_Роль";
	СтруктураКнопка.Вставить("ИмяКнопки", ИмяОписания);
	СтруктураКнопка.Вставить("Заголовок", НСтр("ru='Роль';en='Role'"));
	СтруктураКнопка.Вставить("ИмяКоманды", ИмяОписания);
	СтруктураКнопка.Вставить("Действие", ИмяОписания);
	СтруктураКнопка.Вставить("Отображение", ОтображениеКнопки.Текст);
	СтруктураКнопка.Вставить("ОтображениеФигуры", ОтображениеФигурыКнопки.Всегда);
	
	СтруктураВидимыеКнопки.Вставить(ИмяОписания, СтруктураКнопка);
	
	СтруктураСоздания.Вставить("СтруктураВидимыеКнопки", СтруктураВидимыеКнопки);

	Если CRM_ЛицензированиеЭкспортныеМетоды.ПодсистемаCRMИспользуется() Тогда
		CRM_ЛицензированиеЭкспортныеМетоды.ПолучитьЗащищеннуюОбработку().СформироватьКоманднуюПанельПоСтуктуре(ЭтотОбъект, СтруктураСоздания);
	КонецЕсли;
	
	ГруппаКнопокТумблера = Элементы.Найти("CRM_ТумблерРолеваяАдресация_Группа");
	Если ГруппаКнопокТумблера <> Неопределено Тогда
		ГруппаКнопокТумблера.ГоризонтальноеПоложение = ГоризонтальноеПоложениеЭлемента.Центр;
		ГруппаКнопокТумблера.ГоризонтальноеПоложениеВГруппе = ГоризонтальноеПоложениеЭлемента.Центр;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура CRM_ПокраситьКнопкиРолеваяАдресацияНаСервере()
	
	НомерКнопки = 1;
	
	Если РолеваяАдресация = 0 Тогда
		НомерКнопки = 1;
	ИначеЕсли РолеваяАдресация = 1 Тогда
		НомерКнопки = 2;
	КонецЕсли;
	
	СтруктураВидимыеКнопки = Новый Структура;
	
	СтруктураКнопка = Новый Структура;
	ИмяОписания = "CRM_Ответственный";
	СтруктураКнопка.Вставить("ИмяКнопки", ИмяОписания);
	СтруктураКнопка.Вставить("Пометка", ?(НомерКнопки = 1, Истина, Ложь));
	
	СтруктураВидимыеКнопки.Вставить(ИмяОписания, СтруктураКнопка);
	
	СтруктураКнопка = Новый Структура;
	ИмяОписания = "CRM_Роль";
	СтруктураКнопка.Вставить("ИмяКнопки", ИмяОписания);
	СтруктураКнопка.Вставить("Пометка", ?(НомерКнопки = 2, Истина, Ложь));
	
	СтруктураВидимыеКнопки.Вставить(ИмяОписания, СтруктураКнопка);
	
	Если CRM_ЛицензированиеЭкспортныеМетоды.ПодсистемаCRMИспользуется() Тогда
		CRM_ЛицензированиеЭкспортныеМетоды.ПолучитьЗащищеннуюОбработку().ПокраситьКнопки(ЭтотОбъект, СтруктураВидимыеКнопки);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьКлючНаСервере()
	Возврат  РегистрыСведений.ДатыПоследнейЗагрузкиПочтовыхСообщений.СоздатьКлючЗаписи(Новый Структура("УчетнаяЗапись", Объект.Ссылка));
КонецФункции	

&НаКлиенте
Процедура ДекорацияДатаПолученияПисемНажатие(Элемент)
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеЗакрытияФормыРегистра", ЭтотОбъект);
	
	Попытка
		ПараметрыОткрытия = Новый Структура;
		ПараметрыОткрытия.Вставить("Ключ", ПолучитьКлючНаСервере());
		ОткрытьФорму("РегистрСведений.ДатыПоследнейЗагрузкиПочтовыхСообщений.ФормаЗаписи", ПараметрыОткрытия, ЭтотОбъект,,,, ОписаниеОповещения);
	Исключение
		ОписаниеОшибки = ОписаниеОшибки();
		Если Найти(ОписаниеОшибки, "Объект не найден") Тогда
			СтруктураЗаполнения = Новый Структура;
			СтруктураЗаполнения.Вставить("ЗначенияЗаполнения", Новый Структура("УчетнаяЗапись", Объект.Ссылка));
			ОткрытьФорму("РегистрСведений.ДатыПоследнейЗагрузкиПочтовыхСообщений.ФормаЗаписи", СтруктураЗаполнения, ЭтотОбъект,,,, ОписаниеОповещения);
		КонецЕсли;
	КонецПопытки; 
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияФормыРегистра(Результат, ДопПараметры) Экспорт
	УстановитьНадписьДатыЗагрузки();
КонецПроцедуры

&НаКлиенте
Процедура CRM_НастройкаСинхронизацииПапок(Команда)
	ОткрытьФорму("Справочник.ПапкиЭлектронныхПисем.Форма.CRM_ФормаСинхронизацииПапок", 
		Новый Структура("УчетнаяЗапись", Объект.Ссылка), ЭтотОбъект,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура CRM_СинхронизироватьПапкиСПочтовымСерверомПриИзменении(Элемент)
	Элементы.CRM_НастройкаСинхронизацииПапок.Видимость = Объект.CRM_СинхронизироватьПапкиСПочтовымСервером;
	Элементы.CRM_ОтображатьТолькоПодписанныеПапки.Видимость = Объект.CRM_СинхронизироватьПапкиСПочтовымСервером;
	Если НЕ Объект.CRM_СинхронизироватьПапкиСПочтовымСервером Тогда
		Объект.CRM_ОтображатьТолькоПодписанныеПапки = Ложь;
	Иначе	
		CRM_НастройкаСинхронизацииПапок(Неопределено);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ПравилаОбработки

&НаКлиенте
Процедура ВидимостьПравилОбработки()
	
	Если Объект.CRM_ОбрабатыватьОбращения Тогда
		Если Объект.CRM_ПравилаОбработки.Количество() =1 
			И Объект.CRM_ПравилаОбработки[0].УсловиеОбработки = ПредопределенноеЗначение("Справочник.CRM_УсловияОбработкиОбращений.БезУсловия") Тогда
			Элементы.ПолеПравилоОбработки.Видимость = Истина;
			Элементы.ГруппаСписокПравил.Видимость = Истина;
			Элементы.ГруппаСписокПравил.Заголовок = НСтр("ru = 'Расширенная настройка'");
		Иначе
			Элементы.ПолеПравилоОбработки.Видимость = Ложь;
			Элементы.ГруппаСписокПравил.Видимость = Истина;
			Элементы.ГруппаСписокПравил.Заголовок = НСтр("ru = 'Правила обработки'")+ " (" + Объект.CRM_ПравилаОбработки.Количество()+")";
		КонецЕсли;
	Иначе
		Элементы.ПолеПравилоОбработки.Видимость = Ложь;
		Элементы.ГруппаСписокПравил.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура CRM_ОбрабатыватьОбращенияПриИзменении(Элемент)
	Если Объект.CRM_ОбрабатыватьОбращения Тогда
		Если Объект.CRM_ПравилаОбработки.Количество()= 0 Тогда
			НовПравило = Объект.CRM_ПравилаОбработки.Добавить();
			НовПравило.УсловиеОбработки = ПредопределенноеЗначение("Справочник.CRM_УсловияОбработкиОбращений.БезУсловия");
		КонецЕсли;
	Иначе
		Объект.CRM_ПравилаОбработки.Очистить();
	КонецЕсли;
	ВидимостьПравилОбработки();
КонецПроцедуры

&НаКлиенте
Процедура CRM_ПравилаОбработкиПриИзменении(Элемент)
	
	Если Объект.CRM_ПравилаОбработки.Количество() = 0 Тогда
		Объект.CRM_ОбрабатыватьОбращения = Ложь;
	КонецЕсли;
	ВидимостьПравилОбработки();
		
КонецПроцедуры

#КонецОбласти

// -CRM

#КонецОбласти
